#/bin/bash
#格式: echo "/033[字背景颜色;字体颜色m字符串/033[控制码"
#如果单纯显示字体颜色可以固定控制码位0m。
#格式: echo "/033[字背景颜色;字体颜色m字符串/033[0m"

#字背景颜色范围:40 - 49  #字颜色:30 - 39

#40:黑                   #30:黑
#41:深红                 #31:红
#42:绿                   #32:绿
#43:黄色                 #33:黄
#44:蓝色                 #34:蓝色
#45:紫色                 #35:紫色
#46:深绿                 #36:深绿
#47:白色                 #37:白色

#ANSI控制码

#\033[0m 关闭所有属性
#\033[01m 设置高亮度
#\033[04m 下划线
#\033[05m 闪烁
#\033[07m 反显
#\033[08m 消隐
#\033[30m -- \033[37m 设置前景色
#\033[40m -- \033[47m 设置背景色
#\033[nA 光标上移n行
#\033[nB 光标下移n行
#\033[nC 光标右移n行
#\033[nD 光标左移n行
#\033[y;xH设置光标位置
#\033[2J 清屏
#\033[K 清除从光标到行尾的内容
#\033[s 保存光标位置
#\033[u 恢复光标位置
#\033[?25l 隐藏光标
#\033[?25h 显示光标

for STYLE in 0 1 2 3 4 5 6 7; do
  for FG in 30 31 32 33 34 35 36 37; do
      for BG in 40 41 42 43 44 45 46 47; do
            CTRL="\033[${STYLE};${FG};${BG}m"
            echo -en "${CTRL}"
            echo -n "${STYLE};${FG};${BG}"
            echo -en "\033[0m"
      done
      echo
   done
   echo
done
# Reset
echo -e "\033[0m"
